Repository: NMarjou/localization-app
Catalog: TMs/en-US_pt-PT.tmx
Source language: en_us
Languages: pt_pt

source: Time in role refers to the duration a worker has spent in their current position or role within an organization. This metric is often used to assess experience, eligibility for promotions, transfers, or additional responsibilities.
pt_pt: O tempo na função refere-se à duração que um colaborador passou na sua posição ou função atual dentro de uma organização. Esta métrica é frequentemente utilizada para avaliar a experiência, a elegibilidade para promoções, transferências ou responsabilidades adicionais.

source: Significant field definition
pt_pt: Definição de campo significativo

source: Select the field that will trigger a time in role change for workers.
pt_pt: Selecione o campo que irá desencadear uma alteração de tempo na função para os trabalhadores.

source: Edit significant field
pt_pt: Editar campo significativo

source: The time in role is missing the selected fields.
pt_pt: O tempo na função está em falta nos campos selecionados.

source: Select the fields that will trigger a time in role change for workers.
pt_pt: Selecione os campos que irão desencadear uma alteração de tempo na função para os trabalhadores.

source: Enable time in role
pt_pt: Ativar tempo na função

source: Situation & Absence Configuration
pt_pt: Configuração de Situação e Ausência

source: Company Structure
pt_pt: Estrutura da Empresa

source: You don't have permission to delete this payout curve. Only users with the Global compensation admin role can perform this action.
pt_pt: Não tem permissão para eliminar esta curva de pagamento. Apenas os utilizadores com a função de Administrador de compensação global podem executar esta ação.

source: This payout curve is in "Draft" status and is not used in any bonus plan. Deleting it will permanently remove it from the list. This action cannot be undone.
pt_pt: Esta curva de pagamento está no estado "Rascunho" e não é utilizada em nenhum plano de bónus. Eliminá-la irá removê-la permanentemente da lista. Esta ação não pode ser anulada.

source: Delete payout curve
pt_pt: Eliminar curva de pagamento

source: This payout curve is in "Ready" status and is not used in any bonus plan. Deleting it will permanently remove it from the list. This action cannot be undone.
pt_pt: Esta curva de pagamento está no estado "Pronta" e não é utilizada em nenhum plano de bónus. Eliminá-la irá removê-la permanentemente da lista. Esta ação não pode ser anulada.

source: Are you sure you want to delete the published and used payout curve?
pt_pt: Tem a certeza de que pretende eliminar a curva de pagamento publicada e utilizada?

source: Cannot delete payout curve
pt_pt: Não é possível eliminar a curva de pagamento

source: Used in the following places:
pt_pt: Utilizado nos seguintes locais:

source: The payout curve was successfully deleted.
pt_pt: A curva de pagamento foi eliminada com sucesso.

source: The payout curve was successfully duplicated.
pt_pt: A curva de pagamento foi duplicada com sucesso.

source: Open payout curve
pt_pt: Abrir curva de pagamento

source: The end payout cannot be empty.
pt_pt: O pagamento final não pode estar vazio.

source: The end result cannot be empty.
pt_pt: O resultado final não pode estar vazio.

source: The payout cannot be empty.
pt_pt: O pagamento não pode estar vazio.

source: The result cannot be empty.
pt_pt: O resultado não pode estar vazio.

source: The start payout cannot be empty.
pt_pt: O pagamento inicial não pode estar vazio.

source: The start result cannot be empty.
pt_pt: O resultado inicial não pode estar vazio.

source: Locations
pt_pt: Localizações

source: This payout curve ({{payoutCurveName}}) is currently used in the following bonus plans:
pt_pt: Esta curva de pagamento ({{payoutCurveName}}) está atualmente a ser utilizada nos seguintes planos de bónus:

source: Create skill & competency group
pt_pt: Criar grupo de competências e habilidades

source: No skill & competency groups yet!
pt_pt: Ainda não há grupos de competências e habilidades!

source: Scale
pt_pt: Escala

source: User Segmentation
pt_pt: Segmentação de Utilizadores

source: Exclude individuals
pt_pt: Excluir indivíduos

source: Individuals included
pt_pt: Indivíduos incluídos

source: Grant proxy permission
pt_pt: Conceder permissão de representação

source: Edit proxy permission
pt_pt: Editar permissão de representação

source: View proxy permission
pt_pt: Ver permissão de representação

source: Grant proxy access to:
pt_pt: Conceder acesso de representação a:

source: User with proxy access:
pt_pt: Utilizador com acesso de representação:

source: You haven't added any workers yet. Type in a name to add a worker.
pt_pt: Ainda não adicionou nenhum trabalhador. Digite um nome para adicionar um trabalhador.

source: Who do they need to proxy?
pt_pt: Quem é que eles precisam de representar?

source: Proxy access cannot be defined for at least one worker because they have not accepted the Data Protection Agreement (DPA).
pt_pt: O acesso de representação não pode ser definido para pelo menos um trabalhador porque não aceitou o Acordo de Proteção de Dados (DPA).

source: Proxy access was successfully granted to {{name}}!
pt_pt: O acesso de representação foi concedido com sucesso a {{name}}!

source: View list
pt_pt: Ver lista

source: View proxy access list
pt_pt: Ver lista de acesso de representação

source: Granted by
pt_pt: Concedido por

source: List of workers
pt_pt: Lista de trabalhadores

source: Historical Performance Rating Upload
pt_pt: Carregamento de classificação de desempenho histórico

source: Performance Review Settings
pt_pt: Configurações de avaliação de desempenho

source: Performance Review Template
pt_pt: Modelo de avaliação de desempenho

source: Search in Workbench
pt_pt: Pesquisar na Bancada de trabalho

source: Workers & Professional Roles
pt_pt: Trabalhadores e Funções Profissionais

source: Security & Roles
pt_pt: Segurança e funções

source: Sensitive Content Filtering
pt_pt: Filtragem de conteúdo sensível

source: User session
pt_pt: Sessão de utilizador

source: Smart Features
pt_pt: Funcionalidades inteligentes

source: Enable talent review
pt_pt: Ativar revisão de talento

source: Talent Review Settings
pt_pt: Definições de Revisão de Talento

source: Worker & Manager Pages
pt_pt: Páginas de trabalhador e gestor

source: This category will serve as the default throughout the application.
pt_pt: Esta categoria será utilizada como predefinição em toda a aplicação.

source: Global worker category
pt_pt: Categoria de trabalhador global

source: Create global worker category
pt_pt: Criar categoria de trabalhador global

source: Edit global worker category
pt_pt: Editar categoria global de trabalhador

source: Get started by creating it.
pt_pt: Comece por criá-lo.

source: No global worker category yet.
pt_pt: Ainda não existe categoria de trabalhador global.

source: Define the local worker category that will override the global worker category. The order matters because if a worker is included in multiple configurations, the topmost configuration will be applied.
pt_pt: Defina a categoria de trabalhador local que irá substituir a categoria de trabalhador global. A ordem é importante porque, se um trabalhador estiver incluído em várias configurações, será aplicada a configuração mais acima.

source: Local worker category
pt_pt: Categoria de trabalhador local

source: Create local category
pt_pt: Criar categoria local

source: Are you sure you want to delete this local worker category? This action cannot be undone.
pt_pt: Tem a certeza de que pretende eliminar esta categoria de trabalhador local? Esta ação não pode ser anulada.

source: Delete local worker category
pt_pt: Eliminar categoria de trabalhador local

source: The local worker category was successfully deleted.
pt_pt: A categoria de trabalhador local foi eliminada com sucesso.

source: Blank configuration
pt_pt: Configuração em branco

source: Separator
pt_pt: Separador

source: Total workers
pt_pt: Total de trabalhadores

source: No local worker category
pt_pt: Sem categoria de trabalhador local

source: Fields selected: {{count}}
pt_pt: Campos selecionados: {{count}}

source: Local category name
pt_pt: Nome da categoria local

source: Populations selected: {{count}}
pt_pt: Populações selecionadas: {{count}}

source: Selected population
pt_pt: População selecionada

source: Create local worker category
pt_pt: Criar categoria de trabalhador local

source: Edit local worker category
pt_pt: Editar categoria de trabalhador local

source: Provide a name for the category
pt_pt: Indique um nome para a categoria

source: This population configuration already exists in a different local worker category.
pt_pt: Esta configuração de população já existe numa categoria de trabalhador local diferente.

source: Choose a population for this configuration.
pt_pt: Escolha uma população para esta configuração.

source: At least one population must be selected.
pt_pt: Tem de ser selecionada pelo menos uma população.

source: Worker Category Management
pt_pt: Gestão de Categorias de Trabalhadores

source: Select the field whose values will form part of this worker's category.
pt_pt: Selecione o campo cujos valores farão parte da categoria deste trabalhador.

source: An entity is required.
pt_pt: É necessária uma entidade.

source: A field is required.
pt_pt: Um campo é obrigatório.

source: Fill blank fields value with custom values.
pt_pt: Preencha os campos em branco com valores personalizados.

source: The custom value cannot be longer than 50 characters.
pt_pt: O valor personalizado não pode ter mais de 50 caracteres.

source: A custom value is required when using custom blank values.
pt_pt: É necessário um valor personalizado ao utilizar valores em branco personalizados.

source: Fill blank fields value with a [Blank] value.
pt_pt: Preencher campos em branco com o valor [Em branco].

source: Define how blank values should be handled.
pt_pt: Defina como os valores em branco devem ser tratados.

source: Blank values
pt_pt: Valores em branco

source: Skip blank fields.
pt_pt: Ignorar campos em branco.

source: You must add at least one concatenated field.
pt_pt: Deve adicionar pelo menos um campo concatenado.

source: The blank value behavior is required.
pt_pt: O comportamento de valor em branco é obrigatório.

source: The separator is required.
pt_pt: O separador é obrigatório.

source: You have not added any fields yet.
pt_pt: Ainda não adicionou nenhum campo.

source: Preview (blank):
pt_pt: Pré-visualização (em branco):

source: Preview (default):
pt_pt: Pré-visualização (predefinição):

source: Complete the configuration to see the preview of category of worker.
pt_pt: Conclua a configuração para ver a pré-visualização da categoria de trabalhador.

source: Example of a configuration tailored to the specific use case.
pt_pt: Exemplo de uma configuração adaptada ao caso de uso específico.

source: • (bullet)
pt_pt: • (marcador)

source: : (colon)
pt_pt: : (dois pontos)

source: , (comma)
pt_pt: , (vírgula)

source: - (dash)
pt_pt: - (traço)

source: / (forward slash)
pt_pt: / (barra oblíqua)

source: – (hyphen)
pt_pt: – (hífen)

source: Select the separator you want to use for the configuration.
pt_pt: Selecione o separador que pretende utilizar para a configuração.

source: ; (semicolon)
pt_pt: ; (ponto e vírgula)

source: _ (underscore)
pt_pt: _ (sublinhado)

source: | (vertical bar)
pt_pt: | (barra vertical)
